## OpenTofu Plan: Bootstrap

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_management_group.connectivity will be created
  + resource "azurerm_management_group" "connectivity" {
      + display_name               = "Connectivity"
      + id                         = (known after apply)
      + name                       = "mg-coruscant-connectivity"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.corp will be created
  + resource "azurerm_management_group" "corp" {
      + display_name               = "Corp"
      + id                         = (known after apply)
      + name                       = "mg-coruscant-corp"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.decommissioned will be created
  + resource "azurerm_management_group" "decommissioned" {
      + display_name               = "Decommissioned"
      + id                         = (known after apply)
      + name                       = "mg-coruscant-decommissioned"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.identity will be created
  + resource "azurerm_management_group" "identity" {
      + display_name               = "Identity"
      + id                         = (known after apply)
      + name                       = "mg-coruscant-identity"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.landingzone will be created
  + resource "azurerm_management_group" "landingzone" {
      + display_name               = "Landing Zones"
      + id                         = (known after apply)
      + name                       = "mg-coruscant-landingzone"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.management will be created
  + resource "azurerm_management_group" "management" {
      + display_name               = "Management"
      + id                         = (known after apply)
      + name                       = "mg-coruscant-management"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.online will be created
  + resource "azurerm_management_group" "online" {
      + display_name               = "Online"
      + id                         = (known after apply)
      + name                       = "mg-coruscant-online"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.platform will be created
  + resource "azurerm_management_group" "platform" {
      + display_name               = "Platform"
      + id                         = (known after apply)
      + name                       = "mg-coruscant-platform"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.sandbox will be created
  + resource "azurerm_management_group" "sandbox" {
      + display_name               = "Sandbox"
      + id                         = (known after apply)
      + name                       = "mg-coruscant-sandbox"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-coruscant-root"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # azurerm_management_group.security will be created
  + resource "azurerm_management_group" "security" {
      + display_name               = "Security"
      + id                         = (known after apply)
      + name                       = "mg-coruscant-security"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```
